app/Controllers/Acceuil.php

SELECT *
FROM `produits`
 LIMIT 3
---
    public function main(): string
    {

        $produitmodel = new ProduitModel();
        $donnees["articles"] = $produitmodel->findAll(3);