app/Controllers/Article.php

SELECT *
FROM `produits`
WHERE `categories` = 'plugins'
SELECT *
FROM `produits`
SELECT DISTINCT `categories`
FROM `produits`
---
    public function article($categorie = null): string
    {
        $produitmodel = new ProduitModel();

        if ($categorie) {
            $donnees["articles"] = $produitmodel->where('categories', $categorie)->findAll();
        } else {
            $donnees["articles"] = $produitmodel->findAll();
        }

        $donnees["categories"] = $produitmodel->select('categories')->distinct()->findAll();

SELECT DISTINCT `categories`
FROM `produits`
---
    public function search()
    {
        $produitmodel = new ProduitModel();
        $query = $this->request->getGet('query');

        $donnees["articles"] = $produitmodel->searchProducts($query);
        $donnees["categories"] = $produitmodel->select('categories')->distinct()->findAll();