app/Controllers/Boutique.php

SELECT *
FROM `produits`
WHERE `produits`.`id_produit` = '14'
---
    public function boutique(): string
    {
        // Récupérer l'ID du produit à partir de la requête GET
        $id_produit = $this->request->getGet('id_produit');

        // Vérifier si l'ID du produit est valide
        if ($id_produit) {
            // Charger le modèle ProduitModel
            $produitmodel = new ProduitModel();

            // Récupérer les détails de l'article correspondant à partir de l'ID
            $article = $produitmodel->find($id_produit);

SELECT *
FROM `produits`
WHERE `categories` = 'Pixel'
AND `id_produit` != '14'
 LIMIT 3
---
    private function getArticlesSimilaires($article)
    {
        $produitmodel = new ProduitModel();

        // Exemple : Récupérer des produits similaires par catégorie, exclure le produit actuel
        return $produitmodel->where('categories', $article['categories'])
                            ->where('id_produit !=', $article['id_produit'])
                            ->findAll(3);  // Limiter à 3 produits similaires