app/Controllers/Pan.php

SELECT *
FROM `panier`
---
    public function panier_dashboard(): string
    {
        $paniermodel = new PanierModel();
        $donnees["pan"] = $paniermodel->findAll();