app/Controllers/PanierController.php

    public function ajouter_au_panier()
    {
        // Vérifier que l'utilisateur est connecté
        if (!session()->has('user_id')) {
            return redirect()->to(base_url('Users'))->with('error', 'Veuillez vous connecter pour continuer le processus.');
        }

        $id_produit = $this->request->getPost('id_produit');
        $quantite = $this->request->getPost('quantite');

        $produitmodel = new ProduitModel();
        $article = $produitmodel->find($id_produit);
---
SELECT *
FROM `produits`
WHERE `produits`.`id_produit` = '14'

    public function mes_commandes()
    {
        // Vérifier que l'utilisateur est connecté
        if (!session()->has('user_id')) {
            return redirect()->to(base_url('Users'))->with('error', 'Veuillez vous connecter pour voir vos commandes.');
        }

        // Obtenir l'identifiant de l'utilisateur connecté
        $user_id = session()->get('user_id');

        // Charger les commandes de l'utilisateur depuis la table panier
        $panierModel = new PanierModel();
        $commandes = $panierModel->where('user_id', $user_id)->orderBy('date_ajout', 'DESC')->findAll();
---
SELECT *
FROM `panier`
WHERE `user_id` = '34'
ORDER BY `date_ajout` DESC